In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'A' : {0: 'a', 1 : 'b', 2 : 'c'},
                  'B' : {0: 1, 1: 3, 2: 5},
                  'C' : {0:  2, 1: 4, 2: 6}
                  })

In [4]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [5]:
pd.melt(df, id_vars = ['A'], value_vars = ['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [6]:
pd.melt(df, id_vars = ['A'], value_vars = ['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [7]:
pd.melt(df, id_vars = ['A'], value_vars = ['B', 'C'], var_name = 'VarTeste', value_name = 'Nome do Valor')

   A VarTeste  Nome do Valor
0  a        B              1
1  b        B              3
2  c        B              5
3  a        C              2
4  b        C              4
5  c        C              6